In [8]:
import pandas as pd
import numpy as np

In [9]:
%config IPCompleter.greedy=True

In [17]:
sozlukVerisi = {"Istanbul" : [30,20,np.nan],"Ankara" : [20,np.nan,40],"Izmir" : [10,20,12]}

In [18]:
havaDurumuDataframe =pd.DataFrame(sozlukVerisi)

In [19]:
havaDurumuDataframe

   Istanbul  Ankara  Izmir
0      30.0    20.0     10
1      20.0     NaN     20
2       NaN    40.0     12

In [20]:
havaDurumuDataframe.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     10

In [22]:
havaDurumuDataframe.dropna(axis = 1)

   Izmir
0     10
1     20
2     12

In [25]:
yeniVeri = {"Istanbul" : [30,20,np.nan],"Ankara" : [20,np.nan,40],"Izmir" : [10,20,12],"Antalya" : [45,np.nan,np.nan]}
yeniDataFrame =pd.DataFrame(yeniVeri)

In [26]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     10     45.0
1      20.0     NaN     20      NaN
2       NaN    40.0     12      NaN

In [27]:
yeniDataFrame.dropna(axis=1 ,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     10
1      20.0     NaN     20
2       NaN    40.0     12

In [28]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     10     45.0
1      20.0    20.0     20     20.0
2      20.0    40.0     12     20.0